; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v7 ?v9)
             (pred_1 ?v5 ?v8)
             (pred_12 ?v7 ?v8)
             (pred_2 ?v10 ?v7 )
	     (pred_7 ?v7)
             (pred_11 ?v13)
             (pred_3 ?v5)
             (pred_8 ?v8)
             (pred_4 ?v7)
             (pred_5 ?v5)
             (pred_10 ?v7)
             (pred_9 ))



(:action op_4
:parameters (?v6 ?v1 ?v3 ?v11)
:precondition (and (pred_11 ?v6) (pred_11 ?v1) (pred_3 ?v3) (pred_8 ?v11)
          (pred_6 ?v6 ?v1) (pred_1 ?v3 ?v11)
                   (pred_12 ?v1 ?v11) (pred_7 ?v6) 
                   (pred_4 ?v1) (pred_5 ?v3))
:effect (and  (pred_10 ?v1) (not (pred_4 ?v1))))


(:action op_2
:parameters (?v6 ?v4)
:precondition (and (pred_11 ?v6) (pred_11 ?v4)
               (pred_7 ?v6) (pred_6 ?v6 ?v4) (pred_10 ?v4))
:effect (and (pred_7 ?v4) (not (pred_7 ?v6))))

(:action op_1
:parameters (?v6 ?v3)
:precondition (and (pred_11 ?v6) (pred_3 ?v3) 
                  (pred_7 ?v6) (pred_2 ?v3 ?v6) (pred_9 ))
:effect (and (pred_5 ?v3)
   (not (pred_2 ?v3 ?v6)) (not (pred_9 ))))


(:action op_3
:parameters (?v6 ?v12 ?v2)
:precondition (and (pred_11 ?v6) (pred_3 ?v12) (pred_3 ?v2)
                  (pred_7 ?v6) (pred_5 ?v2) (pred_2 ?v12 ?v6))
:effect (and (pred_5 ?v12) (pred_2 ?v2 ?v6)
        (not (pred_5 ?v2)) (not (pred_2 ?v12 ?v6))))

(:action op_5
:parameters (?v6 ?v3)
:precondition (and (pred_11 ?v6) (pred_3 ?v3) 
                  (pred_7 ?v6) (pred_5 ?v3))
:effect (and (pred_9 ) (pred_2 ?v3 ?v6) (not (pred_5 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_01 obj_16 obj_14 obj_15 obj_09 obj_08 obj_05 obj_07 obj_19 obj_06 obj_20 obj_03 obj_17 obj_11 obj_12
    obj_04 obj_02
    obj_18 obj_13
    )

    (:init
       (pred_9)

       (pred_11 obj_10)
       (pred_11 obj_01)
       (pred_11 obj_16)
       (pred_11 obj_14)
       (pred_11 obj_15)
       (pred_11 obj_09)
       (pred_11 obj_08)
       (pred_11 obj_05)
       (pred_11 obj_07)
       (pred_11 obj_19)
       (pred_11 obj_06)
       (pred_11 obj_20)
       (pred_11 obj_03)
       (pred_11 obj_17)
       (pred_11 obj_11)
       (pred_11 obj_12)
       (pred_8 obj_04)
       (pred_8 obj_02)
       (pred_3 obj_18)
       (pred_3 obj_13)

       (pred_6 obj_10 obj_15)
       (pred_6 obj_10 obj_01)
       (pred_6 obj_01 obj_09)
       (pred_6 obj_01 obj_16)
       (pred_6 obj_01 obj_10)
       (pred_6 obj_16 obj_08)
       (pred_6 obj_16 obj_14)
       (pred_6 obj_16 obj_01)
       (pred_6 obj_14 obj_05)
       (pred_6 obj_14 obj_16)
       (pred_6 obj_15 obj_07)
       (pred_6 obj_15 obj_09)
       (pred_6 obj_15 obj_10)
       (pred_6 obj_09 obj_19)
       (pred_6 obj_09 obj_08)
       (pred_6 obj_09 obj_01)
       (pred_6 obj_09 obj_15)
       (pred_6 obj_08 obj_06)
       (pred_6 obj_08 obj_05)
       (pred_6 obj_08 obj_16)
       (pred_6 obj_08 obj_09)
       (pred_6 obj_05 obj_20)
       (pred_6 obj_05 obj_14)
       (pred_6 obj_05 obj_08)
       (pred_6 obj_07 obj_03)
       (pred_6 obj_07 obj_19)
       (pred_6 obj_07 obj_15)
       (pred_6 obj_19 obj_17)
       (pred_6 obj_19 obj_06)
       (pred_6 obj_19 obj_09)
       (pred_6 obj_19 obj_07)
       (pred_6 obj_06 obj_11)
       (pred_6 obj_06 obj_20)
       (pred_6 obj_06 obj_08)
       (pred_6 obj_06 obj_19)
       (pred_6 obj_20 obj_12)
       (pred_6 obj_20 obj_05)
       (pred_6 obj_20 obj_06)
       (pred_6 obj_03 obj_17)
       (pred_6 obj_03 obj_07)
       (pred_6 obj_17 obj_11)
       (pred_6 obj_17 obj_19)
       (pred_6 obj_17 obj_03)
       (pred_6 obj_11 obj_12)
       (pred_6 obj_11 obj_06)
       (pred_6 obj_11 obj_17)
       (pred_6 obj_12 obj_20)
       (pred_6 obj_12 obj_11)
       (pred_4 obj_14)
       (pred_4 obj_09)
       (pred_12  obj_14 obj_04)
       (pred_12  obj_09 obj_02)
       (pred_10 obj_10)
       (pred_10 obj_01)
       (pred_10 obj_16)
       (pred_10 obj_15)
       (pred_10 obj_08)
       (pred_10 obj_05)
       (pred_10 obj_07)
       (pred_10 obj_19)
       (pred_10 obj_06)
       (pred_10 obj_20)
       (pred_10 obj_03)
       (pred_10 obj_17)
       (pred_10 obj_11)
       (pred_10 obj_12)

       (pred_1  obj_18 obj_04)
       (pred_1  obj_13 obj_02)
       (pred_2 obj_18 obj_08)
       (pred_2 obj_13 obj_06)
       (pred_7 obj_03)
    )

    (:goal (and
       (pred_2 obj_18 obj_16)
    ))
(:constraints
  (always (not (pred_7 obj_19)))
)
)

; plan
1. (op_2 obj_03 obj_07)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_07)
   goals met: 0 of 1
2. (op_2 obj_07 obj_15)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_15)
   goals met: 0 of 1
3. (op_2 obj_15 obj_10)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_10)
   goals met: 0 of 1
4. (op_2 obj_10 obj_01)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_01)
   goals met: 0 of 1
5. (op_2 obj_01 obj_16)
   deleted: (pred_7 obj_01)
   added: (pred_7 obj_16)
   goals met: 0 of 1
6. (op_2 obj_16 obj_08)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_08)
   goals met: 0 of 1
7. (op_1 obj_08 obj_18)
   deleted: (pred_2 obj_18 obj_08) (pred_9)
   added: (pred_5 obj_18)
   goals met: 0 of 1
8. (op_2 obj_08 obj_16)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_16)
   goals met: 0 of 1
9. (op_5 obj_16 obj_18)
   deleted: (pred_5 obj_18)
   added: (pred_9) (pred_2 obj_18 obj_16)
   goals met: 1 of 1
